Repository: eternity-oath/secretflow
Catalog: docs/locales/*/LC_MESSAGES/user_guide/mpc_*/feature_eng.po
Languages: ml

source: Feature Engineering
ml: 特征工程

source: The following codes are demos only. It’s **NOT for production** due to system security concerns, please **DO NOT** use it directly in production.
ml: 本页面中的代码仅供参考，部署模式存在安全问题，请 **不要** 作为生产代码使用。

source: It is recommended to use `jupyter <https://jupyter.org/>`__ to run this tutorial.
ml: 推荐使用 `jupyter <https://jupyter.org/>`__ 运行本教程。

source: Secretflow provides a variety of tools to analyze the statistics of the dataset in order to improve the quality of results from the machine learning process.
ml: Secretflow 提供了多种工具来分析数据集，以提高机器学习结果的质量。

source: Preparation
ml: 初始化

source: Initialize secretflow and create two parties alice and bob.
ml: 初始化Secretflow，并创建alice/bob两个计算参与方兼数据提供方。

source: 💡 Before using preprocessing, you may need to get to know secretflow’s `DataFrame <../preprocessing/DataFrame.ipynb>`__.
ml: 使用前请先了解Secretflow的数据集设定 `DataFrame <../preprocessing/DataFrame.ipynb>`__。

source: Data Preparation
ml: 准备Demo数据

source: Here we use linear as example data.
ml: 使用一组线性拟合数据作为示例。

source: Pearson product-moment correlation coefficient
ml: 皮尔逊积矩相关系数

source: The Pearson product-moment correlation coefficient is used to measure the degree of correlation (linear correlation) between two variables X and Y.
ml: 皮尔逊积矩相关系数可以用来探查两个变量X/Y之间的线性相关性的强度。

source: The Pearson product-moment correlation coefficient between two variables is defined as the covariance of the two variables divided by the product of their standard deviations:
ml: 两个变量之间的皮尔逊积矩相关系数定义为两个变量的协方差除以其标准差的乘积：

source: The Pearson product-moment correlation coefficient for samples(features) from dataset, usually represented by the lowercase letter r:
ml: 数据集中样本（特征）的皮尔逊积矩相关系数，通常用小写字母 r 表示：

source: Its value is between -1 and 1. :math:`r>0` corresponds to a positive correlation between features, otherwise it is a negative correlation; the larger the :math:`|r|`, the greater the degree of correlation.
ml: 其值介于-1与1之间。 :math:`r>0` 对应两者正相关，反之为负相关； :math:`|r|` 越大，相关程度越大。

source: SecretFlow provides ``SSVertPearsonR`` for calculating Pearson product-moment correlation coefficient of Vertical DataFrame using secret sharing.
ml: SecretFlow 的 ``SSVertPearsonR`` 模块可以用于探查垂直划分数据集的皮尔逊积矩相关系数，计算过程使用秘密分享协议保护。

source: SSVertPearsonR will standardize input dataset first. After standardized, all features’ variance is 1 and the mean is 0, the calculation is simplified to:
ml: SSVertPearsonR会首先标准化数据集，这样一来所有特征的均值为0方差为1，可以将计算简化为：

source: Variance inflation factor
ml: 方差扩大因子

source: Variance Inflation Factor (VIF) was used to detect multicollinearity between variables. In a linear statistical model, the variance inflation factor (VIF) of a coefficient is equal to the quotient of the variance of that coefficient in a multivariate model and the variance of that coefficient in a model with only one variable. In simple terms, it refers to the ratio of the variance when there is multicollinearity among the explanatory variables (features) to the variance when there is no multicollinearity.
ml: 方差扩大因子 (VIF) 用于探查变量之间的多重共线性。在一个线性统计模型中，一个系数的方差扩大因子等于多元模型中该系数方差与一元模型中该系数方差的商，简单来说，就是解释变量（特征）之间存在多重共线性时的方差与不存在多重共线性时的方差之比。

source: SecretFlow provides ``SSVertVIF`` for calculating variance inflation factor of Vertical DataFrame using secret sharing.
ml: SecretFlow 的 ``SSVertVIF`` 模块可以用于探查垂直划分数据集的方差扩大因子，计算过程使用秘密分享协议保护。

source: The vif value of the j-th feature is:
ml: 第j个特征的vif值为：

source: Notice:
ml: 注意：

source: The analytical solution of matrix inversion in secret sharing is very expensive, so this method uses Newton iteration to find approximate solution.
ml: 在秘密分享协议下计算矩阵逆开销非常大，所以这里使用牛顿迭代进行近似。

source: When there is multicollinearity in the input dataset, the XTX matrix is not full rank, and the analytical solution for the inverse of the XTX matrix does not exist.
ml: 当输入数据集中存在完全线性相关时， :math:`X^TX` 矩阵不满秩， :math:`X^TX` 矩阵逆的解析解不存在。

source: The VIF results of these linear correlational columns calculated by statsmodels are INF, indicating that the correlation is infinite. However, this method will get a large VIF value (>>1000) on these columns, which can also correctly reflect the strong correlation of these columns.
ml: statsmodels在完全线性相关列上计算的VIF为INF，意为无限大的相关性。而我们提供的模块会输出一个很大的值(>>1000)，也能正确的表示这些列之间存在很强的相关性。

source: When there are constant columns in the data, the VIF result calculated by statsmodels is NAN, and the result of this method is also a large VIF value (>> 1000), means these columns need to be removed before training.
ml: 对于常量列，statsmodels的结果是NAN，我们的模块依然是很大的值(>>1000)，表明这个列在建模前需要被剔除。

source: Therefore, although the results of this method cannot be completely consistent with statemodels that calculations in plain text, but they can still correctly reflect the correlation of the input data columns.
ml: 所以本模块的结果虽然无法和statemodels这类明文计算的结果完全一致，但依然能正确的反映出特征间的相关性。

source: Hypothesis Testing for Regression Coefficients
ml: 线性模型/广义线性模型系数显著检验

source: Linear / logistic regression variable significance test for all features (explanatory variables) use to judge whether the parameter is significant, that is, whether the independent variable can effectively predict the variation of the dependent variable, so as to determine whether the corresponding explanatory variable should be included in the model.
ml: 线性/逻辑回归变量显著性检验用于判断特征（解释变量）是否显著，即自变量是否能有效预测因变量的变化，从而判断对应的解释变量是否应被包含在模型中。

source: Hypothesis Testing for linear Regression Coefficients
ml: 线性回归系数显著检验

source: For linear regression :math:`y=Xω` (X contains a constant term), use the t-test to test whether the regression term coefficients have zero values.
ml: 对线性回归 :math:`y=Xω` （X包含常数项），使用t检验来对回归项系数检验其值是否为零。

source: Assume:
ml: 其中：

source: In the case where the five assumptions made by OLS are all established, the statistic:
ml: 在最小二乘法5条假设都成立的情况下，统计量：

source: where n is sample size, k is feature size.
ml: 其中，n为样本量，k为特征数

source: The null and alternative hypotheses tested are:
ml: 检验的原假设和备择假设为：

source: Bring the null hypothesis of the test into :math:`t_j` :
ml: 将检验的原假设带入 :math:`t_j` ：

source: Hypothesis Testing for Logistic Regression Coefficients
ml: 逻辑回归系数显著检验

source: For logistic regression
ml: 对于逻辑回归

source: Wald test :math:`Wald=(\hat{ω}_k/SE(\hat{ω}_k ) )^2` fits a chi-square distribution with 1 degree of freedom.
ml: Wald test :math:`Wald=(\hat{ω}_k/SE(\hat{ω}_k ) )^2` 符合自由度为1的卡方分布。

source: Where :math:`SE(\hat{ω}_k )` is the standard error of :math:`ω_k`, which is the square root of the diagonal elements of the variance-covariance matrix:
ml: 其中 :math:`SE(\hat{ω}_k )` 是 :math:`ω_k` 的标准误差, 为方差协方差矩阵的对角元素的平方根：

source: The variance and covariance matrices of the model parameters are the values ​​of the inverse of the Hessian matrix of the log-likelihood function at :math:`\hat{ω}`:
ml: 模型参数的方差和协方差矩阵，为对数似然函数的Hessian矩阵的逆在 :math:`\hat{ω}` 处的值：

source: Where:
ml: 其中：

source: The Hessian matrix is ​​expressed as :math:`H=X^T A X`, A is a n*n matrix, where:
ml: Hessian矩阵表示为 :math:`H=X^T A X`， A矩阵为：

source: Available:
ml: 可得：

source: SecretFlow provides ``SSPValue`` for calculating P-Value of hypothesis testing using secret sharing.
ml: SecretFlow 的 ``SSPValue`` 模块可以用于探查模型的P-Value，计算过程使用秘密分享协议保护。

source: For linear regression:
ml: 线性回归模型：

source: calculate prediction residuals :math:`\hat{ε}=Xω - y`
ml: 计算预测残差 :math:`\hat{ε}=Xω - y`

source: calculate :math:`\hat{σ}^2=\hat{ε}^T\hat{ε} /(n-k)`
ml: 计算 :math:`\hat{σ}^2=\hat{ε}^T\hat{ε} /(n-k)`

source: get :math:`(X^T X)^{-1}` by Newton iteration
ml: 通过牛顿迭代计算 :math:`(X^T X)^{-1}`

source: For logistic regression:
ml: 逻辑回归模型：

source: calculate :math:`H=X^TAX`
ml: 计算 :math:`H=X^TAX`

source: get :math:`H^{-1}` by Newton iteration
ml: 通过牛顿迭代计算 :math:`H^{-1}`

source: calculate :math:`z^2=ω^2/H^{-1}_{kk}`
ml: 计算 :math:`z^2=ω^2/H^{-1}_{kk}`
